##### SECTION 1 - 변수와 단순한 데이터 타입 #####

# 1. 변수
# 1.1 변수 선언
# 1.2 변수 재할당
# 1.3 변수 이름 규칙

# 2. 문자
# 2.1 문자 만들기
# 2.2 문자 연결
# 2.3 대소문자 변경
# 2.4 공백 문자
# 2.5 공백 잘라내기

# 3. 숫자
# 3.1 숫자 종류
# 3.2 연산
# 3.3 연산 우선순위
# 3.4 이상한 수
# 3.5 문자로 바꾸기

# 4. 주석

# 5. 파이썬 철학


##### SECTION 2 - 리스트 #####

# 1. 리스트 기본
# 1.1 리스트 만들기
# 1.2 요소 접근

# 2. 요소 수정, 추가, 제거
# 2.1 요소 수정
# 2.2 요소 추가 2가지
# 2.3 요소 제거 3가지

# 3. 정렬
# 3.1 임시 정렬
# 3.2 영구 정렬
# 3.3 역순 정렬
# 3.4 리스트 길이 알아내기


##### SECTION 3 - 리스트 다루기 #####

# 1. 리스트 for 문

# 2. 숫자리스트
# 2.1 range()
# 2.2 숫자리스트 만들기
# 2.3 간단한 통계
# 2.4 리스트 내포

# 3. 리스트 자르기
# 3.1 슬라이스
# 3.2 슬라이스 반복
# 3.3 리스트 복제

# 4. 튜플
# 4.1 튜플 만들기
# 4.2 튜플 반복
# 4.3 튜플 덮어쓰기


##### SECTION 4 - if 문 #####

# 1. 조건테스트
# 1.1 일치 체크
# 1.2 불일치 체크
# 1.3 숫자 비교
# 1.4 여러 조건 체크
# 1.5 리스트에 값이 있는지 체크
# 1.6 리스트에 값이 없는지 체크
# 1.7 불리언 표현식

# 2. if 문
# 2.1 기본 if 문
# 2.2 if - else 문
# 2.3 if - elif - else 문

# 3. 리스트와 조건문
# 3.1 리스트안에 특정한 값이 있는지 체크
# 3.2 빈 리스트가 아닌지 체크
# 3.3 여러 리스트 다루기


##### SECTION 5 - 딕셔너리 #####

# 1. 딕셔너리 기본
# 1.1 딕셔너리 만들기
# 1.2 값 접근
# 1.3 값 수정
# 1.4 키-값 쌍 지우기
# 1.5 키-값 쌍 추가하기

# 2. 딕셔너리 반복
# 2.1 모든 키-값 쌍에 반복
# 2.2 모든 키에 반복
# 2.3 모든 값에 반복

# 3. 중첩 
# 3.1 리스트 안에 딕셔너리
# 3.2 딕셔너리 안에 리스트
# 3.3 딕셔너리 안에 딕셔너리


##### SECTION 6 - 사용자 입력과 while 루프 #####
 
# 1. 사용자 입력
# 1.1 input()
# 1.2 숫자 입력 받기

# 2. while 루프
# 2.1 기본 사용법
# 2.2 break
# 2.3 continue
# 2.4 플래그 만들기

# 3. 리스트와 딕셔너리에 while루프 
# 3.1 리스트에서 리스트로 요소 옮기기
# 3.2 리스트에서 특정 값 모두 지우기
# 3.3 사용자가 입력한 값으로 딕셔너리 채우기


##### SECTION 7 - 함수 #####

# 1. 함수 기초
# 1.1 함수 정의
# 1.2 함수 매개변수

# 2. 매개변수
# 2.1 위치형 매개변수
# 2.2 키워드 매개변수
# 2.3 기본값 
# 2.4 매개변수를 옵션으로 

# 3. 리턴값
# 3.1 단순한 값 리턴
# 3.2 딕셔너리 리턴

# 4. 리스트 전달 
# 4.1 함수에서 리스트 수정 

# 5. 매개변수를 임의로 전달
# 5.1 임의의 매개변수 튜플
# 5.2 임의의 키워드 매개변수 

# 6. 모듈화
# 6.1 전체 모듈 임포트
# 6.2 함수만 임포트
# 6.3 별칭 붙이기 


##### SECTION 8 - 클래스 #####

# 1. 클래스 기본 
# 1.1 클래스 만들기 
# 1.2 클래스 인스턴스 만들기 
# 1.3 속성 접근
# 1.4 메서드 호출

# 2 클래스와 인스턴스 다루기
# 2.1 속성 기본값 설정
# 2.2 속성값 바꾸기

# 3. 상속
# 3.1 상속하는법
# 3.2 메서드 오버라이드
# 3.3 속성 인스턴스

# 4. 클래스 모듈
# 4.1 전체 임포트
# 4.2 특정 클래스 임포트
# 4.3 별칭
# 4.4 모듈에서 모듈 임포트